Reports/ОтчетПоЗадолженностиНасиленияФорма_18.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ОтчетПоЗадолженностиНасиленияФорма_18</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЖилойНеЖилойФонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЖилойНеЖилойФонд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жилой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЖилой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Услуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Услуги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПотребителяУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеНормПотребления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияНормПотребления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияРасчетнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеПрибораУчетаДляЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬУсловиеРасчетаЛьготы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬДополнительнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговыйМетод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПорогов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМашиноМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетаПоСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаПоСредней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаПоСредней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВидамТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьЭнергоемкость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУХолоднаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУГарячаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвоКубов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслугиПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыТарифов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетПоЗадолженностиНасиленияФорма_18/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Период.ДатаНачала = НачалоДня(ТекущаяДата());
	Отчет.Период.ДатаОкончания = КонецДня(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтчетНаСервере()
	тзМиргород.Очистить();
	тзбагачка.Очистить();
	Макет = Отчеты.ОтчетПоЗадолженностиНасиленияФорма_18.ПолучитьМакет("Форма15_04_10_2022_Д_18");
	спУслуг = Новый СписокЗначений;
	спУслугЖЕК = Новый СписокЗначений;
	спУслугЖЕК.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000181")); // Управління багатоповерховим будинком ( Гоголя 52 )
	спУслугЖЕК.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000261")); // Управління багатоповерховим будинком ( Козацька 3 )
	спУслугЖЕК.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000262")); // Управління багатоповерховим будинком ( Старосвітська 8 )
	
	КодКОАТУУМиргород = "5310900000";
	Результат.Очистить();
	// Отримаємо к-ть абонентів Миргород по ТЕ
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслугЖЕК);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород = тзМиргород.Добавить();
	НовСтрокаМиргород.КвоАбонентовЖЕК = КвоАбонентовМиргород.Количество() / 1000;
	спАбонентовМиргород = Новый СписокЗначений;
	Для Каждого стр Из КвоАбонентовМиргород Цикл
		спАбонентовМиргород.Добавить(стр.ЛицевойСчет);
	КонецЦикла;
	
	// Оплати по абонентам Миргород за останні 3 місяці
	тзДолжники = Новый ТаблицаЗначений;
	тзДолжники.Колонки.Добавить("ЛицевойСчет");
	тзДолжники.Колонки.Добавить("Долг");
	ЗапросДолг3Месяца = Новый Запрос;
	ЗапросДолг3Месяца.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Долг3Месяца,
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ЛицевойСчет В (&ЛицевойСчет)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	ЗапросДолг3Месяца.УстановитьПараметр("ЛицевойСчет",   спАбонентовМиргород);
	ЗапросДолг3Месяца.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Отчет.Период.ДатаНачала), -3));
	ЗапросДолг3Месяца.УстановитьПараметр("КонецПериода",  КонецМесяца(Отчет.Период.ДатаОкончания));
	РезультатОплаты = ЗапросДолг3Месяца.Выполнить();
	ВыборкаОплаты = РезультатОплаты.Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл
		Если ВыборкаОплаты.Долг3Месяца = 1 Тогда
		    НовСтрокаДолг = тзДолжники.Добавить();
			НовСтрокаДолг.ЛицевойСчет = ВыборкаОплаты.ЛицевойСчет;
			НовСтрокаДолг.Долг = ВыборкаОплаты.Долг3Месяца;
		КонецЕсли;
	КонецЦикла;
	НовСтрокаМиргород.КвоАбонентовДолгБольше3Месяцев = тзДолжники.Количество() / 1000;
		
	// Виберемо заборгованість по особовим рахункам за вказаний період по Миргороду
	ЗапросДолги = Новый Запрос;
	ЗапросДолги.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолги.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолги.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросДолги.УстановитьПараметр("Услуга", спУслугЖЕК);
	РезультатДолгМиргород = ЗапросДолги.Выполнить().Выгрузить();
	НовСтрокаМиргород.ДолгЖЕКНаНачалоПериода = РезультатДолгМиргород.Итог("СуммаОстаток") / 1000;
	
	// Виберемо нарахування за звітній період по Миргороду
	ЗапросНачисленияМиргород = Новый Запрос;
	ЗапросНачисленияМиргород.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга";
	ЗапросНачисленияМиргород.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияМиргород.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияМиргород.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросНачисленияМиргород.УстановитьПараметр("Услуга", спУслугЖЕК);
	РезультатНачисления = ЗапросНачисленияМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.НачисленоЖЕКЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо оплати за звітній період по Миргороду
	ЗапросОплатиМиргород = Новый Запрос;
	ЗапросОплатиМиргород.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатиМиргород.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатиМиргород.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатиМиргород.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросОплатиМиргород.УстановитьПараметр("Услуга", спУслугЖЕК);
	РезультатНачисления = ЗапросОплатиМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.ОплаченоЖЕКЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Залишок боргу на кінець звітного періоду
	НовСтрокаМиргород.ДолгЗаЖЕКНаКонецПериод = НовСтрокаМиргород.ДолгЖЕКНаНачалоПериода - НовСтрокаМиргород.ОплаченоЖЕКЗаПериод + НовстрокаМиргород.НачисленоЖЕКЗаПериод;
		
	// Заполним табличный документ
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Период = Отчет.Период;
	Результат.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Результат.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.ПорядковыйНомер = 1;
	ОбластьСтрока.Параметры.Организация                       = Справочники.Организации.НайтиПоКоду("000000001");
	ОбластьСтрока.Параметры.НаселенныйПункт                   = "Миргород";
	ОбластьСтрока.Параметры.ОКПП                              = "45136285";
	ОбластьСтрока.Параметры.КвоАбонентовЖЕК                   = тзМиргород[0].КвоАбонентовЖЕК;
	ОбластьСтрока.Параметры.КвоАбонентовСДолгомБольше3Месяцев = тзМиргород[0].КвоАбонентовДолгБольше3Месяцев;
	ОбластьСтрока.Параметры.ДолгНаНачалоПериода               = тзМиргород[0].ДолгЖЕКНаНачалоПериода;
	ОбластьСтрока.Параметры.НачисленоЖЕКЗаПериод              = тзМиргород[0].НачисленоЖЕКЗаПериод;
	ОбластьСтрока.Параметры.ОплаченоЖЕКЗаПериод               = тзМиргород[0].ОплаченоЖЕКЗаПериод;
	ОбластьСтрока.Параметры.ДолгЗаЖЕКНаКонецПериод            = тзМиргород[0].ДолгЗаЖЕКНаКонецПериод;
	Результат.Вывести(ОбластьСтрока);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтчет(Команда)
	ЗаполнитьОтчетНаСервере();
КонецПроцедуры
